## Plan Result (demo_global)




<pre><code>Plan: 9 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;cui-ra&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;cui-ra&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;cui-ra&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;cui-ra&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;cui-ra&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;cui-ra&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;cui-ra&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;cui-ra&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;cui-ra&#34;]
* Update
  * module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain["cui-ra"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo"
      + expiration_date          = (known after apply)
      + host_name                = "cui-ra.demo.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "cui-ra"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["cui-ra"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["cui-ra"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom["cui-ra"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "cuirademoPremium"
      + resource_group_name   = "lz-demo-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cui-session"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtCookie"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtLatC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtPC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxVisitor"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxvt"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "rf"
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin["cui-ra"] will be created
  + resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "cui-ra"
      + origin_host_header             = "cui-ra.demo.platform.hmcts.net"
      + priority                       = 1
      + weight                         = 50
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group["cui-ra"] will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      + cdn_frontdoor_profile_id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo"
      + id                                                        = (known after apply)
      + name                                                      = "cui-ra"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + load_balancing {
          + additional_latency_in_milliseconds = 0
          + sample_size                        = 4
          + successful_samples_required        = 2
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A["cui-ra"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/afdEndpoints/hmcts-demo"
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpOnly"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "cui-ra"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Https",
        ]

      + cache {
          + compression_enabled           = false
          + query_string_caching_behavior = "UseQueryString"
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B["cui-ra"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/afdEndpoints/hmcts-demo"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/originGroups/defaultBackend"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/originGroups/defaultBackend/origins/defaultBackend",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/ruleSets/httpsredirect",
        ]
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "cui-raHttpsRedirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
        ]
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["cui-ra"] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      + cdn_frontdoor_profile_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo"
      + id                       = (known after apply)
      + name                     = "cuirademoPremium-securityPolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 9 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1853,"Program":"tfcmt","SHA1":"","Target":"demo_global","Vars":{}} -->